Revit 2027 API
FabricationPart.InsulationArea Property
 The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double InsulationArea { get; }
Public ReadOnly Property InsulationArea As Double
	Get
public:
property double InsulationArea {
	double get ();
}
member InsulationArea : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace